In [30]:
import pandas as pd

df = pd.read_csv('./ch5.csv')
df.head()

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20

In [31]:
# numpy 주입
import numpy as np

# 결측값 col 추가
df['원산지'] = np.nan
df.head()

      메뉴    가격  칼로리  원산지
0  아메리카노  4500   10  NaN
1   카페라떼  5000  110  NaN
2   카페모카  5500  250  NaN
3   카푸치노  5000  110  NaN
4  에스프레소  4000   20  NaN

In [32]:
# 결측값 데이터 삽입
df.loc[0, '원산지'] = '콜롬비아' # pandas에서 NaN은 기본적으로 float 타입으로 취급하기 때문에 경고메시지 나옴
df.loc[2:3, '원산지'] = '과테말라'
df.head()

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_5836\1923145264.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '콜롬비아' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.loc[0, '원산지'] = '콜롬비아' # pandas에서 NaN은 기본적으로 float 타입으로 취급하기 때문에 경고메시지 나옴

      메뉴    가격  칼로리   원산지
0  아메리카노  4500   10  콜롬비아
1   카페라떼  5000  110   NaN
2   카페모카  5500  250  과테말라
3   카푸치노  5000  110  과테말라
4  에스프레소  4000   20   NaN

In [33]:
# list로 row 추가
df.loc['시즌']  = [ # list로 추가할 시 col 개수에 맞게 다 채워야함 / 안 그러면 에러
	'크리스마스라떼',
	6000,
	300,
	'대한민국'
]
df.head(10)

         메뉴    가격  칼로리   원산지
0     아메리카노  4500   10  콜롬비아
1      카페라떼  5000  110   NaN
2      카페모카  5500  250  과테말라
3      카푸치노  5000  110  과테말라
4     에스프레소  4000   20   NaN
5       밀크티  5900  210   NaN
6        녹차  5300    0   NaN
시즌  크리스마스라떼  6000  300  대한민국

In [34]:
# dic으로 row 추가
df.loc[7] = { # dic으로 추가할 시 빈 col은 NaN으로 대체
	'메뉴': '디카페인커피',
	'가격': 5000,
	'칼로리': 20,
}
df.head(10)

         메뉴    가격  칼로리   원산지
0     아메리카노  4500   10  콜롬비아
1      카페라떼  5000  110   NaN
2      카페모카  5500  250  과테말라
3      카푸치노  5000  110  과테말라
4     에스프레소  4000   20   NaN
5       밀크티  5900  210   NaN
6        녹차  5300    0   NaN
시즌  크리스마스라떼  6000  300  대한민국
7    디카페인커피  5000   20   NaN

In [ ]:
df = df.drop('시즌', axis=0)
df.head(10)

       메뉴    가격  칼로리   원산지
0   아메리카노  4500   10  콜롬비아
1    카페라떼  5000  110   NaN
2    카페모카  5500  250  과테말라
3    카푸치노  5000  110  과테말라
4   에스프레소  4000   20   NaN
5     밀크티  5900  210   NaN
6      녹차  5300    0   NaN
7  디카페인커피  5000   20   NaN

In [38]:
df.to_csv('../chapter6/ch6.csv', index=False)